// 商品
export const commoditys = [
  '雀巢咖啡',
  '可口可乐',
  '百事可乐',
  '康师傅方便面',
  '农夫山泉',
  '雪碧',
  '麦香熔岩蛋糕',
  '周杰伦手抓饼',
  '嘉士利威化饼干',
  '统一冰红茶',
  '三只松鼠松果',
  '良品铺子开心果',
  '脆脆鲨威化饼干',
];

// 商品类型
export const commodityTypes = [
  '咖啡类',
  '功能饮料',
  '碳酸饮料',
  '饮用水',
  '凉茶',
  '方便面',
  '纯牛奶',
  '生鲜食品',
  '预调酒',
  '养生酒',
];

// 机器组名列表
export const machineGroupNameList = [
  { value: '东莞塘厦分组', label: '东莞塘厦分组' },
  { value: '香港九龙分组', label: '香港九龙分组' },
  { value: '广州天河分组', label: '广州天河分组' },
  { value: '深圳南山分组', label: '深圳南山分组' },
  { value: '佛山禅城分组', label: '佛山禅城分组' },
  { value: '珠海香洲分组', label: '珠海香洲分组' },
  { value: '北京分组', label: '北京分组' },
  { value: '湖南长沙分组', label: '湖南长沙分组' },
  { value: '湖南张家界分组', label: '湖南张家界分组' },
  { value: '四川成都分组', label: '四川成都分组' },
  { value: '黑龙江哈尔滨分组', label: '黑龙江哈尔滨分组' },
];

export const machineGroupNameValues = [
  '东莞塘厦分组',
  '香港九龙分组',
  '广州天河分组',
  '深圳南山分组',
  '佛山禅城分组',
  '珠海香洲分组',
  '北京分组',
  '湖南长沙分组',
  '湖南张家界分组',
  '四川成都分组',
  '黑龙江哈尔滨分组',
];

// 机器编号列表
export const machineNumberList = [
  { value: '87213214435', label: '87213214435' },
  { value: '34524352231', label: '34524352231' },
  { value: '12334551224', label: '12334551224' },
  { value: '96325120122', label: '96325120122' },
  { value: '45630046272', label: '45630046272' },
  { value: '34566456788', label: '34566456788' },
  { value: '12345683456', label: '12345683456' },
  { value: '95464534534', label: '95464534534' },
  { value: '77874546234', label: '77874546234' },
  { value: '54534534656', label: '54534534656' },
];

export const machineNumberValues = [
  '87213214435',
  '34524352231',
  '12334551224',
  '96325120122',
  '45630046272',
  '34566456788',
  '12345683456',
  '95464534534',
  '77874546234',
  '54534534656',
];

// 开启/关闭
export const switchList = [
  { value: '开启', label: '开启' },
  { value: '关闭', label: '关闭' },
];